To confirm in the code, whether validation of node name is happening before or after the evaluation of expression, i have added some debug statements in code and tried below config

Here i am using test variable output in node name 

provider "bigip" {
  address  = "xxxx"
  username = "xxx"
  password = "xxx"
}

variable  "test" {
default = "testing"
}

resource "bigip_ltm_node" "node" {
  name    = "/Common/${var.test}"
  address = "10.10.10.10"
}

root@terraforn-ubuntu3:~/go/src/github.com/terraform-providers/terraform-provider-bigip# terraform apply
2020/03/20 08:17:04 [INFO] Terraform version: 0.12.6  
2020/03/20 08:17:04 [INFO] Go runtime version: go1.12.6
................................
020-03-20T08:17:05.298-0700 [DEBUG] plugin.terraform-provider-bigip: 2020/03/20 08:17:05 [INFO] Initializing BigIP connection
**### 2020-03-20T08:17:05.382-0700 [DEBUG] plugin.terraform-provider-bigip: 2020/03/20 08:17:05 i am here for debug: [/Common/testing]
2020-03-20T08:17:05.382-0700 [DEBUG] plugin.terraform-provider-bigip: 2020/03/20 08:17:05 i am here in debug loop : /Common/testing
2020-03-20T08:17:05.382-0700 [DEBUG] plugin.terraform-provider-bigip: 2020/03/20 08:17:05 i am here for debug match : true**

Terraform will perform the following actions:

  # bigip_ltm_node.node will be created
  + resource "bigip_ltm_node" "node" {
2020/03/20 08:17:05 [DEBUG] command: asking for input: "Do you want to perform these actions?"
      + address          = "10.10.10.10"
      + connection_limit = (known after apply)
      + dynamic_ratio    = (known after apply)
      + id               = (known after apply)
      + monitor          = "/Common/icmp"
      **+ name             = "/Common/testing"**
      + rate_limit       = (known after apply)
      + ratio            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


From the above debug statements, it is clear that in the code where validation of node name is happening after it resolved the expression ( /common/testing ) i.e., var.test value is resolved to "testing" and then it is validated by regular expression.

so can we try taking that big expression to some variable , and use that variable in node name. So i hope that when variable is referenced, it will resolved in variable in itself and then it will be used in node name.

variable test {
default = ${vra7_deployment.my_vra7_deployment[0].resource_configuration[”LinuxRedHat6_VM.name”]}

}

resource "bigip_ltm_node" "node" {
  name             = "/common/$var.test"
......
}


Are we using multiple providers ( VRA7, bigip ) in same .tf file ?  If so we have to use depends_on, to make sure VRA7 provider output variables are calculated fully and then been used in bigip provider.



